Repository: pathexplorer/BigBikeData
Catalog: site_handler/site_handler/translations/*/LC_MESSAGES/messages.po
Languages: uk

source: No file part in the request.
uk: У запиті немає файлової частини.

source: Email address is required.
uk: Потрібна адреса електронної пошти.

source: No file was selected.
uk: Файл не вибрано.

source: Invalid file type. Only .fit files are accepted.
uk: Недійсний тип файлу. Приймаються лише файли .fit.

source: An unexpected error occurred during upload or processing.
uk: Під час завантаження або обробки сталося щось дивне.

source: Clean .fit files from teleports
uk: Очистити файл .fit від телепортів

source: Error:
uk: Помилка:

source: Input your email (for results)
uk: Введіть свою електронну адресу (для результатів)

source: Upload your .fit file
uk: Завантажте свій файл .fit

source: Select a file
uk: Виберіть файл

source: or drag and drop
uk: або перетягніть у це вікно

source: FIT file format only. Max 10MB.
uk: Тільки формат файлу FIT. Макс. 10 МБ.

source: Start Cleaning Process
uk: Розпочати процес очищення

source: File ready for cleaning!
uk: Файл готовий до очищення!

source: Processing...
uk: Обробка...

source: Thank you! Your file is being processed. We will email the result.
uk: Дякуємо! Ваш файл обробляється. Ми надішлемо вам результат електронною поштою.

source: Upload another file
uk: Завантажити ще файл

source: Support:
uk: Підтримка:

source: Cherkasy, Ukraine
uk: Черкаси, Україна

source: Oops, the link is expired and not valid anymore. Please upload your file again.
uk: Отакої, посилання вже не активне. Будь-ласка, завантажте свій файл знову

source: Internal Server Error
uk: Внутрішня помилка на сервері

source: An Unexpected Error Occurred
uk: Сталось щось неочікуване

source: We have been notified of the issue and are working to fix it. Please try again later.
uk: Ми будемо проінформовані про цю помилку і займемось її виправленням. Будь-ласка, спобуйте пізніше

source: Return to Homepage
uk: Повернутись на головну сторінку

source: 404 - Page Not Found
uk: 404 - Сторінка не знайдена

source: How it works
uk: Як працює сервіс

source: The service cleans the FIT file by removing specific teleportation errors caused by GPS.
uk: Сервіс очищає FIT файл, видаляючи специфічні телепортації, спричинені помилками GPS.

source: All other data (heart rate, cadence, power, and speed) from those corrected seconds is preserved.
uk: Усі інші дані (пульс, каденс, потужність та швидкість) із цих виправлених секунд зберігаються.

source: To ensure accurate distance and speed, you must use a speed sensor with your bike computer.
uk: Щоб забезпечити точну дистанцію та швидкість, необхідно використовувати на велокомп'ютері датчик швидкості.

source: It is recommended to pause the bike computer manually during stops (not with auto-pause). This will further improve the quality of the cleaning.
uk: Рекомендується ставити велокомпютер на паузу при зупинках примусово (не автопаузою). Це ще більше покращить якість очистки.

source: Only very large teleportations will be corrected (for example, if you suddenly jump to Lima, Peru).
uk: Виправляються лише дуже великі телепортації (наприклад, якщо ви раптово перемістилися до Ліми, Перу)

source: A download link for the cleaned file will be sent to the user's email.
uk: Посилання для завантаження очищеного файлу буде надіслано на електронну пошту користувача.

source: All data is deleted from the server after the link expires.
uk: Усі дані видаляються з сервера після закінчення терміну дії посилання.

source: Smart cleaning FIT sports activity files with speed sensors from incorrect GPS points
uk: Спеціальне очищення файлів спортивної активності FIT з датчиком швидкості від некоректних точок GPS
